SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy6.upload.workaround=

atxy6.bootloader.flashcommand=

##############################################################

atxy4.name=ATtiny1614/1604/814/804/414/404/214/204

atxy4.menu.chip.1614=ATtiny1614
atxy4.menu.chip.1614.build.mcu=attiny1614
atxy4.menu.chip.1614.upload.maximum_size=16384
atxy4.menu.chip.1614.upload.maximum_data_size=2048
atxy4.menu.chip.814=ATtiny814
atxy4.menu.chip.814.build.mcu=attiny814
atxy4.menu.chip.814.upload.maximum_size=8192
atxy4.menu.chip.814.upload.maximum_data_size=512
atxy4.menu.chip.414=ATtiny414
atxy4.menu.chip.414.build.mcu=attiny414
atxy4.menu.chip.414.upload.maximum_size=4096
atxy4.menu.chip.414.upload.maximum_data_size=256
atxy4.menu.chip.214=ATtiny214
atxy4.menu.chip.214.build.mcu=attiny214
atxy4.menu.chip.214.upload.maximum_size=2048
atxy4.menu.chip.214.upload.maximum_data_size=128
atxy4.menu.chip.1604=ATtiny1604
atxy4.menu.chip.1604.build.mcu=attiny1604
atxy4.menu.chip.1604.upload.maximum_size=16384
atxy4.menu.chip.1604.upload.maximum_data_size=1024
atxy4.menu.chip.804=ATtiny804
atxy4.menu.chip.804.build.mcu=attiny804
atxy4.menu.chip.804.upload.maximum_size=8192
atxy4.menu.chip.804.upload.maximum_data_size=512
atxy4.menu.chip.404=ATtiny404
atxy4.menu.chip.404.build.mcu=attiny404
atxy4.menu.chip.404.upload.maximum_size=4096
atxy4.menu.chip.404.upload.maximum_data_size=256
atxy4.menu.chip.204=ATtiny204
atxy4.menu.chip.204.build.mcu=attiny204
atxy4.menu.chip.204.upload.maximum_size=2048
atxy4.menu.chip.204.upload.maximum_data_size=128

atxy4.menu.clock.20=20 MHz
atxy4.menu.clock.16=16 MHz
atxy4.menu.clock.10=10 MHz
atxy4.menu.clock.8=8 MHz
atxy4.menu.clock.5=5 MHz
atxy4.menu.clock.4=4 MHz
atxy4.menu.clock.1=1 MHz
atxy4.menu.clock.20.build.f_cpu=20000000L
atxy4.menu.clock.16.build.f_cpu=16000000L
atxy4.menu.clock.10.build.f_cpu=10000000L
atxy4.menu.clock.8.build.f_cpu=8000000L
atxy4.menu.clock.5.build.f_cpu=5000000L
atxy4.menu.clock.4.build.f_cpu=4000000L
atxy4.menu.clock.1.build.f_cpu=1000000L
atxy4.menu.clock.20.bootloader.OSCCFG=0x02
atxy4.menu.clock.16.bootloader.OSCCFG=0x01
atxy4.menu.clock.10.bootloader.OSCCFG=0x02
atxy4.menu.clock.8.bootloader.OSCCFG=0x01
atxy4.menu.clock.5.bootloader.OSCCFG=0x02
atxy4.menu.clock.4.bootloader.OSCCFG=0x01
atxy4.menu.clock.1.bootloader.OSCCFG=0x01

atxy4.menu.bodvoltage.1v8=1.8V
atxy4.menu.bodvoltage.2v15=2.15V
atxy4.menu.bodvoltage.2v6=2.6V
atxy4.menu.bodvoltage.2v95=2.95V
atxy4.menu.bodvoltage.3v3=3.30V
atxy4.menu.bodvoltage.3v7=3.70V
atxy4.menu.bodvoltage.4v0=4.00V
atxy4.menu.bodvoltage.4v3=4.30V
atxy4.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy4.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy4.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy4.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4.menu.bodmodeactive.disabled=Disabled
atxy4.menu.bodmodeactive.enabled=Enabled
atxy4.menu.bodmodeactive.sampled=Sampled
atxy4.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy4.menu.bodmodesleep.disabled=Disabled
atxy4.menu.bodmodesleep.enabled=Enabled
atxy4.menu.bodmodesleep.sampled=Sampled
atxy4.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy4.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy4.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy4.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy4.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy4.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy4.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy4.menu.eesave.enable=EEPROM retained
atxy4.menu.eesave.enable.bootloader.SYSCFG0=0xC7
atxy4.menu.eesave.disable=EEPROM not retained
atxy4.menu.eesave.disable.bootloader.SYSCFG0=0xC6

atxy4.menu.dacvref.0v55=0.55V
atxy4.menu.dacvref.1v1=1.10V
atxy4.menu.dacvref.1v5=1.50V
atxy4.menu.dacvref.2v5=2.50V
atxy4.menu.dacvref.4v3=4.30V
atxy4.menu.dacvref.disabled=Disabled (saves flash)
atxy4.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy4.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy4.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy4.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy4.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
atxy4.menu.dacvref.disabled.build.dacvref=

atxy4.menu.millis.enabled=Enabled (default timer)
atxy4.menu.millis.disabled=Disabled (saves flash)
atxy4.menu.millis.timera=TCA0 (default on 0-series)
atxy4.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4.menu.millis.timerb1=TCB1 (1614 only)
atxy4.menu.millis.rtc=RTC (no micros)
atxy4.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy4.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERD0_A0
atxy4.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
atxy4.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
atxy4.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
atxy4.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
atxy4.menu.millis.timerb1.build.millis=-DMILLIS_USE_TIMERB1
atxy4.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
atxy4.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

atxy4.menu.neopixelport.porta=PORTA (pins 0~3,8~11)
atxy4.menu.neopixelport.portb=PORTB (pins 4~7)
atxy4.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy4.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT

atxy4.menu.uartvoltage.5v=Closer to 5v
atxy4.menu.uartvoltage.3v=Closer to 3v
atxy4.menu.uartvoltage.5v.build.uartvoltage=
atxy4.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V


atxy4.upload.tool=avrdude

atxy4.build.board=attinyxy4
atxy4.build.core=arduino
atxy4.build.variant=txy4
atxy4.build.text_section_start=.text=0x0
atxy4.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} {build.neopixelport} {build.uartvoltage}
atxy4.build.export_merged_output=false

atxy4.bootloader.tool=avrdude
atxy4.bootloader.WDTCFG=0x00
atxy4.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy4.bootloader.TCD0CFG=0x00
atxy4.bootloader.SYSCFG1=0x03
atxy4.bootloader.APPEND=0x00
atxy4.bootloader.BOOTEND=0x00

