SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy4.upload.workaround=
atxy4.bootloader.flashcommand=


##############################################################

atxy2.name=ATtiny412/402/212/202

#atxy2.menu.chip.812=ATtiny812
#atxy2.menu.chip.812.build.mcu=attiny812
#atxy2.menu.chip.812.upload.maximum_size=8192
#atxy2.menu.chip.812.upload.maximum_data_size=512
#atxy2.menu.chip.812.upload.workaround=
atxy2.menu.chip.412=ATtiny412
atxy2.menu.chip.412.build.mcu=attiny412
atxy2.menu.chip.412.upload.maximum_size=4096
atxy2.menu.chip.412.upload.maximum_data_size=256
atxy2.menu.chip.412.upload.workaround=
atxy2.menu.chip.212=ATtiny212
atxy2.menu.chip.212.build.mcu=attiny212
atxy2.menu.chip.212.upload.maximum_size=2048
atxy2.menu.chip.212.upload.maximum_data_size=128
atxy2.menu.chip.212.upload.workaround=
#atxy2.menu.chip.802=ATtiny802
#atxy2.menu.chip.802.build.mcu=attiny802
#atxy2.menu.chip.802.upload.maximum_size=8192
#atxy2.menu.chip.802.upload.maximum_data_size=512
#atxy2.menu.chip.802.upload.workaround=
atxy2.menu.chip.402=ATtiny402
atxy2.menu.chip.402.build.mcu=attiny402
atxy2.menu.chip.402.upload.maximum_size=4096
atxy2.menu.chip.402.upload.maximum_data_size=256
atxy2.menu.chip.402.upload.workaround=
atxy2.menu.chip.402w=ATtiny402 (bad signature)
atxy2.menu.chip.402w.build.mcu=attiny402
atxy2.menu.chip.402w.upload.maximum_size=4096
atxy2.menu.chip.402w.upload.maximum_data_size=256
atxy2.menu.chip.402w.upload.workaround=w
atxy2.menu.chip.202=ATtiny202
atxy2.menu.chip.202.build.mcu=attiny202
atxy2.menu.chip.202.upload.maximum_size=2048
atxy2.menu.chip.202.upload.maximum_data_size=128
atxy2.menu.chip.202.upload.workaround=

atxy2.menu.clock.20=20 MHz
atxy2.menu.clock.16=16 MHz
atxy2.menu.clock.10=10 MHz
atxy2.menu.clock.8=8 MHz
atxy2.menu.clock.5=5 MHz
atxy2.menu.clock.4=4 MHz
atxy2.menu.clock.1=1 MHz
atxy2.menu.clock.20.build.f_cpu=20000000L
atxy2.menu.clock.16.build.f_cpu=16000000L
atxy2.menu.clock.10.build.f_cpu=10000000L
atxy2.menu.clock.8.build.f_cpu=8000000L
atxy2.menu.clock.5.build.f_cpu=5000000L
atxy2.menu.clock.4.build.f_cpu=4000000L
atxy2.menu.clock.1.build.f_cpu=1000000L
atxy2.menu.clock.20.bootloader.OSCCFG=0x02
atxy2.menu.clock.16.bootloader.OSCCFG=0x01
atxy2.menu.clock.10.bootloader.OSCCFG=0x02
atxy2.menu.clock.8.bootloader.OSCCFG=0x01
atxy2.menu.clock.5.bootloader.OSCCFG=0x02
atxy2.menu.clock.4.bootloader.OSCCFG=0x01
atxy2.menu.clock.1.bootloader.OSCCFG=0x01

atxy2.menu.bodvoltage.1v8=1.8V
atxy2.menu.bodvoltage.2v15=2.15V
atxy2.menu.bodvoltage.2v6=2.6V
atxy2.menu.bodvoltage.2v95=2.95V
atxy2.menu.bodvoltage.3v3=3.30V
atxy2.menu.bodvoltage.3v7=3.70V
atxy2.menu.bodvoltage.4v0=4.00V
atxy2.menu.bodvoltage.4v3=4.30V
atxy2.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy2.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy2.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy2.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2.menu.bodmodeactive.disabled=Disabled
atxy2.menu.bodmodeactive.enabled=Enabled
atxy2.menu.bodmodeactive.sampled=Sampled
atxy2.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy2.menu.bodmodesleep.disabled=Disabled
atxy2.menu.bodmodesleep.enabled=Enabled
atxy2.menu.bodmodesleep.sampled=Sampled
atxy2.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy2.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy2.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy2.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy2.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy2.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy2.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.SYSCFG0=0xC7
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.SYSCFG0=0xC6

atxy2.menu.dacvref.0v55=0.55V
atxy2.menu.dacvref.1v1=1.10V
atxy2.menu.dacvref.1v5=1.50V
atxy2.menu.dacvref.2v5=2.50V
atxy2.menu.dacvref.4v3=4.30V
atxy2.menu.dacvref.disabled=Disabled (saves flash)
atxy2.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy2.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy2.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy2.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy2.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
atxy2.menu.dacvref.disabled.build.dacvref=

atxy2.menu.millis.enabled=Enabled (default timer)
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.timera=TCA0 (default on 402/202)
atxy2.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2.menu.millis.rtc=RTC (no micros)
atxy2.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERD0_A0
atxy2.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
atxy2.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
atxy2.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
atxy2.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
atxy2.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC

atxy2.upload.tool=avrdude

atxy2.bootloader.flashcommand=

atxy2.bootloader.tool=avrdude

atxy2.menu.uartvoltage.5v=Closer to 5v
atxy2.menu.uartvoltage.3v=Closer to 3v
atxy2.menu.uartvoltage.5v.build.uartvoltage=
atxy2.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V


atxy2.build.board=attinyxy2
atxy2.build.core=arduino
atxy2.build.variant=txy2
atxy2.build.text_section_start=.text=0x0
atxy2.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} -DNEOPIXELPORT=VPORTA.OUT {build.uartvoltage}
atxy2.build.export_merged_output=false

atxy2.bootloader.tool=avrdude
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy2.bootloader.TCD0CFG=0x00
atxy2.bootloader.SYSCFG1=0x03
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00

#

# Xplained boards with Tiny-1 chips

Xplained416.name=Attiny416 Xplained Nano (optiboot)
Xplained416.build.mcu=attiny416
Xplained416.build.board=attinyxy6
Xplained416.build.core=arduino
Xplained416.build.variant=txy6
Xplained416.build.f_cpu=20000000
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.uartvoltage}
Xplained416.upload.tool=avrdude
Xplained416.upload.workaround=
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D
Xplained416.bootloader.file=optiboot_x/optiboot_xplained416.hex
Xplained416.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained416.bootloader.tool=avrdude
Xplained416.bootloader.BOOTEND=0x2
Xplained416.bootloader.OSCCFG=0x02
Xplained416.bootloader.WDTCFG=0x00
Xplained416.bootloader.BODCFG=0b00000000
Xplained416.bootloader.TCD0CFG=0x00
Xplained416.bootloader.SYSCFG0=0xC9
Xplained416.bootloader.SYSCFG1=0x03
Xplained416.bootloader.APPEND=0x00

Xplained416.menu.dacvref.0v55=0.55V
Xplained416.menu.dacvref.1v1=1.10V
Xplained416.menu.dacvref.1v5=1.50V
Xplained416.menu.dacvref.2v5=2.50V
Xplained416.menu.dacvref.4v3=4.30V
Xplained416.menu.dacvref.disabled=Disabled (saves flash)
Xplained416.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
Xplained416.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
Xplained416.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
Xplained416.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
Xplained416.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
Xplained416.menu.dacvref.disabled.build.dacvref=

Xplained416.menu.neopixelport.porta=PORTA (pins 0~3,14~17)
Xplained416.menu.neopixelport.portb=PORTB (pins 4~9)
Xplained416.menu.neopixelport.portc=PORTC (pins 10~13)
Xplained416.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
Xplained416.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
Xplained416.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

Xplained416.menu.millis.enabled=Enabled
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.enabled.build.millis=
Xplained416.menu.millis.disabled.build.millis=-DDISABLE_MILLIS
Xplained416.menu.millis.enabled=Enabled (default timer)
Xplained416.menu.millis.disabled=Disabled (saves flash)
Xplained416.menu.millis.timera=TCA0
Xplained416.menu.millis.timerd=TCD0 (default)
Xplained416.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained416.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERD0
Xplained416.menu.millis.rtc=RTC (no micros)
Xplained416.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
Xplained416.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
Xplained416.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
Xplained416.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
Xplained416.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
Xplained416.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
Xplained416.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

Xplained416.menu.uartvoltage.5v=Closer to 5v
Xplained416.menu.uartvoltage.3v=Closer to 3v
Xplained416.menu.uartvoltage.5v.build.uartvoltage=
Xplained416.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V



Xplained817.name=Attiny817 Xplained Mini (optiboot)
Xplained817.build.mcu=attiny817
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.f_cpu=20000000
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.uartvoltage}
Xplained817.upload.tool=avrdude
Xplained817.upload.workaround=
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D
Xplained817.bootloader.file=optiboot_x/optiboot_xplained817.hex
Xplained817.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
Xplained817.bootloader.tool=avrdude
Xplained817.bootloader.BOOTEND=0x2
Xplained817.bootloader.OSCCFG=0x02
Xplained817.bootloader.WDTCFG=0x00
Xplained817.bootloader.BODCFG=0b00000000
Xplained817.bootloader.TCD0CFG=0x00
Xplained817.bootloader.SYSCFG0=0xC9
Xplained817.bootloader.SYSCFG1=0x03
Xplained817.bootloader.APPEND=0x00

Xplained817.menu.dacvref.0v55=0.55V
Xplained817.menu.dacvref.1v1=1.10V
Xplained817.menu.dacvref.1v5=1.50V
Xplained817.menu.dacvref.2v5=2.50V
Xplained817.menu.dacvref.4v3=4.30V
Xplained817.menu.dacvref.disabled=Disabled (saves flash)
Xplained817.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
Xplained817.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
Xplained817.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
Xplained817.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
Xplained817.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
Xplained817.menu.dacvref.disabled.build.dacvref=

Xplained817.menu.millis.enabled=Enabled
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.enabled.build.millis=
Xplained817.menu.millis.disabled.build.millis=-DDISABLE_MILLIS

Xplained817.menu.millis.enabled=Enabled (default timer)
Xplained817.menu.millis.disabled=Disabled (saves flash)
Xplained817.menu.millis.timera=TCA0
Xplained817.menu.millis.timerd=TCD0 (default)
Xplained817.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
Xplained817.menu.millis.rtc=RTC (no micros)
Xplained817.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
Xplained817.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERD0
Xplained817.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
Xplained817.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
Xplained817.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
Xplained817.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
Xplained817.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
Xplained817.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

