SpenceKonde/megaTinyCore/megaavr/boards.txt
Xplained817.menu.neopixelport.porta=PORTA (pins 0~3,18~21)
Xplained817.menu.neopixelport.portb=PORTB (pins 4~11)
Xplained817.menu.neopixelport.portc=PORTC (pins 12~17)
Xplained817.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
Xplained817.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
Xplained817.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

Xplained817.menu.uartvoltage.5v=Closer to 5v
Xplained817.menu.uartvoltage.3v=Closer to 3v
Xplained817.menu.uartvoltage.5v.build.uartvoltage=
Xplained817.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V


# Separate board types for chips with Optiboot.  Reduces menu clutter.

atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.mcu=attiny3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.mcu=attiny1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.mcu=attiny817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.mcu=attiny417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.mcu=attiny1607
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.mcu=attiny807
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20=20 MHz
atxy7o.menu.clock.16=16 MHz
atxy7o.menu.clock.10=10 MHz
atxy7o.menu.clock.8=8 MHz
atxy7o.menu.clock.5=5 MHz
atxy7o.menu.clock.4=4 MHz
atxy7o.menu.clock.1=1 MHz
atxy7o.menu.clock.20.build.f_cpu=20000000L
atxy7o.menu.clock.16.build.f_cpu=16000000L
atxy7o.menu.clock.10.build.f_cpu=10000000L
atxy7o.menu.clock.8.build.f_cpu=8000000L
atxy7o.menu.clock.5.build.f_cpu=5000000L
atxy7o.menu.clock.4.build.f_cpu=4000000L
atxy7o.menu.clock.1.build.f_cpu=1000000L
atxy7o.menu.clock.20.bootloader.OSCCFG=0x02
atxy7o.menu.clock.16.bootloader.OSCCFG=0x01
atxy7o.menu.clock.10.bootloader.OSCCFG=0x02
atxy7o.menu.clock.8.bootloader.OSCCFG=0x01
atxy7o.menu.clock.5.bootloader.OSCCFG=0x02
atxy7o.menu.clock.4.bootloader.OSCCFG=0x01
atxy7o.menu.clock.1.bootloader.OSCCFG=0x01

atxy7o.menu.bodvoltage.1v8=1.8V
atxy7o.menu.bodvoltage.2v15=2.15V
atxy7o.menu.bodvoltage.2v6=2.6V
atxy7o.menu.bodvoltage.2v95=2.95V
atxy7o.menu.bodvoltage.3v3=3.30V
atxy7o.menu.bodvoltage.3v7=3.70V
atxy7o.menu.bodvoltage.4v0=4.00V
atxy7o.menu.bodvoltage.4v3=4.30V
atxy7o.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodmodeactive.disabled=Disabled
atxy7o.menu.bodmodeactive.enabled=Enabled
atxy7o.menu.bodmodeactive.sampled=Sampled
atxy7o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy7o.menu.bodmodesleep.disabled=Disabled
atxy7o.menu.bodmodesleep.enabled=Enabled
atxy7o.menu.bodmodesleep.sampled=Sampled
atxy7o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy7o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy7o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy7o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy7o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy7o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy7o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy7o.menu.dacvref.0v55=0.55V
atxy7o.menu.dacvref.1v1=1.10V
atxy7o.menu.dacvref.1v5=1.50V
atxy7o.menu.dacvref.2v5=2.50V
atxy7o.menu.dacvref.4v3=4.30V
atxy7o.menu.dacvref.disabled=Disabled (saves flash)
atxy7o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy7o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy7o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy7o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy7o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
atxy7o.menu.dacvref.disabled.build.dacvref=

atxy7o.menu.millis.enabled=Enabled (default timer)
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.timera=TCA0 (default on 0-series)
atxy7o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7o.menu.millis.timerb1=TCB1 (3217,1617 only)
atxy7o.menu.millis.rtc=RTC (no micros)
atxy7o.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy7o.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERD0_A0
atxy7o.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
atxy7o.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
atxy7o.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
atxy7o.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
atxy7o.menu.millis.timerb1.build.millis=-DMILLIS_USE_TIMERB1
atxy7o.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
atxy7o.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

atxy7o.menu.neopixelport.porta=PORTA (pins 0~3,18~21)
atxy7o.menu.neopixelport.portb=PORTB (pins 4~11)
atxy7o.menu.neopixelport.portc=PORTC (pins 12~17)
atxy7o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy7o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
atxy7o.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

atxy7o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy7o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}.hex
atxy7o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy7o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy7o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy7{bootloader.uartswap}_rst.hex
atxy7o.menu.resetpin.reset.bootloader.resetpinbits=10
atxy7o.menu.resetpin.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy7o.menu.resetpin.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy7o.menu.resetpin.gpio.bootloader.resetpinbits=00

atxy7o.menu.uartvoltage.5v=Closer to 5v
atxy7o.menu.uartvoltage.3v=Closer to 3v
atxy7o.menu.uartvoltage.5v.build.uartvoltage=
atxy7o.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V


atxy7o.upload.tool=avrdude

atxy7o.build.board=attinyxy7
atxy7o.build.core=arduino
atxy7o.build.variant=txy7
atxy7o.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.uartvoltage}
atxy7o.build.export_merged_output=true

atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy7o.bootloader.TCD0CFG=0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}01
atxy7o.bootloader.SYSCFG1=0x03
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02



atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D
atxy7o.upload.workaround=
atxy7o.build.text_section_start=.text=0x200
atxy7o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy7o.bootloader.tool=avrdude

