SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy6o.upload.protocol=arduino
atxy6o.upload.extra_params=-D
atxy6o.build.text_section_start=.text=0x200
atxy6o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy6o.bootloader.BOOTEND=0x2
atxy6o.bootloader.tool=avrdude

##############################################################

atxy4o.name=ATtiny1614/1604/814/804/414/404/214/204 (optiboot)
atxy4o.upload.speed=115200

atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.mcu=attiny1614
atxy4o.menu.chip.1614.upload.maximum_size=16384
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.mcu=attiny814
atxy4o.menu.chip.814.upload.maximum_size=8192
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.mcu=attiny414
atxy4o.menu.chip.414.upload.maximum_size=4096
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.mcu=attiny214
atxy4o.menu.chip.214.upload.maximum_size=2048
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.mcu=attiny1604
atxy4o.menu.chip.1604.upload.maximum_size=16384
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.mcu=attiny804
atxy4o.menu.chip.804.upload.maximum_size=8192
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.mcu=attiny404
atxy4o.menu.chip.404.upload.maximum_size=4096
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.mcu=attiny204
atxy4o.menu.chip.204.upload.maximum_size=2048
atxy4o.menu.chip.204.upload.maximum_data_size=128

atxy4o.menu.clock.20=20 MHz
atxy4o.menu.clock.16=16 MHz
atxy4o.menu.clock.10=10 MHz
atxy4o.menu.clock.8=8 MHz
atxy4o.menu.clock.5=5 MHz
atxy4o.menu.clock.4=4 MHz
atxy4o.menu.clock.1=1 MHz
atxy4o.menu.clock.20.build.f_cpu=20000000L
atxy4o.menu.clock.16.build.f_cpu=16000000L
atxy4o.menu.clock.10.build.f_cpu=10000000L
atxy4o.menu.clock.8.build.f_cpu=8000000L
atxy4o.menu.clock.5.build.f_cpu=5000000L
atxy4o.menu.clock.4.build.f_cpu=4000000L
atxy4o.menu.clock.1.build.f_cpu=1000000L
atxy4o.menu.clock.20.bootloader.OSCCFG=0x02
atxy4o.menu.clock.16.bootloader.OSCCFG=0x01
atxy4o.menu.clock.10.bootloader.OSCCFG=0x02
atxy4o.menu.clock.8.bootloader.OSCCFG=0x01
atxy4o.menu.clock.5.bootloader.OSCCFG=0x02
atxy4o.menu.clock.4.bootloader.OSCCFG=0x01
atxy4o.menu.clock.1.bootloader.OSCCFG=0x01

atxy4o.menu.dacvref.0v55=0.55V
atxy4o.menu.dacvref.1v1=1.10V
atxy4o.menu.dacvref.1v5=1.50V
atxy4o.menu.dacvref.2v5=2.50V
atxy4o.menu.dacvref.4v3=4.30V
atxy4o.menu.dacvref.disabled=Disabled (saves flash)
atxy4o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy4o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy4o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy4o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy4o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3
atxy4o.menu.dacvref.disabled.build.dacvref=

atxy4o.menu.millis.enabled=Enabled (default timer)
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.timera=TCA0 (default on 0-series)
atxy4o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy4o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy4o.menu.millis.timerb1=TCB1 (1614 only)
atxy4o.menu.millis.rtc=RTC (no micros)
atxy4o.menu.millis.rtcxtal=RTC w/w32khz xtal (no micros)
atxy4o.menu.millis.enabled.build.millis=-DMILLIS_USE_TIMERD0_A0
atxy4o.menu.millis.disabled.build.millis=-DDISABLE_MILLIS -DMILLIS_USE_TIMERD0_A0
atxy4o.menu.millis.timera.build.millis=-DMILLIS_USE_TIMERA0
atxy4o.menu.millis.timerd.build.millis=-DMILLIS_USE_TIMERD0
atxy4o.menu.millis.timerb0.build.millis=-DMILLIS_USE_TIMERB0
atxy4o.menu.millis.timerb1.build.millis=-DMILLIS_USE_TIMERB1
atxy4o.menu.millis.rtc.build.millis=-DMILLIS_USE_TIMERRTC
atxy4o.menu.millis.rtcxtal.build.millis=-DMILLIS_USE_TIMERRTC_XTAL

atxy4o.menu.neopixelport.porta=PORTA (pins 0~3,8~11)
atxy4o.menu.neopixelport.portb=PORTB (pins 4~7)
atxy4o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy4o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT

atxy4o.menu.bodvoltage.1v8=1.8V
atxy4o.menu.bodvoltage.2v15=2.15V
atxy4o.menu.bodvoltage.2v6=2.6V
atxy4o.menu.bodvoltage.2v95=2.95V
atxy4o.menu.bodvoltage.3v3=3.30V
atxy4o.menu.bodvoltage.3v7=3.70V
atxy4o.menu.bodvoltage.4v0=4.00V
atxy4o.menu.bodvoltage.4v3=4.30V
atxy4o.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy4o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4o.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy4o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4o.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy4o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4o.menu.bodmodeactive.disabled=Disabled
atxy4o.menu.bodmodeactive.enabled=Enabled
atxy4o.menu.bodmodeactive.sampled=Sampled
atxy4o.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy4o.menu.bodmodesleep.disabled=Disabled
atxy4o.menu.bodmodesleep.enabled=Enabled
atxy4o.menu.bodmodesleep.sampled=Sampled
atxy4o.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy4o.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy4o.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy4o.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy4o.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy4o.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy4o.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy4o.menu.uartvoltage.5v=Closer to 5v
atxy4o.menu.uartvoltage.3v=Closer to 3v
atxy4o.menu.uartvoltage.5v.build.uartvoltage=
atxy4o.menu.uartvoltage.3v.build.uartvoltage=-DUARTBAUD3V



atxy4o.upload.tool=avrdude

atxy4o.build.board=attinyxy4
atxy4o.build.core=arduino
atxy4o.build.variant=txy4
atxy4o.build.extra_flags={build.millis} -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} {build.neopixelport} {build.uartvoltage}
atxy4o.build.export_merged_output=true
atxy4o.upload.workaround=
atxy4o.upload.protocol=arduino
atxy4o.upload.extra_params=-D
atxy4o.build.text_section_start=.text=0x200
atxy4o.bootloader.flashcommand=-Uflash:w:{runtime.platform.path}/bootloaders/{bootloader.file}:i
atxy4o.bootloader.tool=avrdude

atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy4o.bootloader.TCD0CFG=0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}01
atxy4o.bootloader.SYSCFG1=0x03
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02

atxy4o.menu.resetpin.UPDI=UPDI (powercycle to enter bootloader)
atxy4o.menu.resetpin.UPDI.bootloader.file=optiboot_x/optiboot_txy4{bootloader.uartswap}.hex
atxy4o.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy4o.menu.resetpin.reset=Reset (DANGER - Read docs first!)
atxy4o.menu.resetpin.reset.bootloader.file=optiboot_x/optiboot_txy4{bootloader.uartswap}_rst.hex
atxy4o.menu.resetpin.reset.bootloader.resetpinbits=10
atxy4o.menu.resetpin.gpio=IO (DANGER - Read docs first! powercycle to enter bootloader)
atxy4o.menu.resetpin.gpio.bootloader.file=optiboot_x/optiboot_txy2{bootloader.uartswap}.hex
atxy4o.menu.resetpin.gpio.bootloader.resetpinbits=00


